In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("sample_data.csv")
df

     Name   Age           City   Salary  Is_Employed
0    John  30.0       New York      NaN         True
1    Jane  25.0    Los Angeles  50000.0        False
2     NaN  40.0        Chicago  60000.0         True
3    Mike  35.0            NaN  70000.0        False
4   Emily   NaN        Houston  80000.0         True
5   David  45.0        Phoenix      NaN        False
6   Sarah  30.0         Dallas  55000.0         True
7   Chris  25.0        Seattle  65000.0        False
8     NaN  40.0         Denver  75000.0         True
9  Olivia  35.0  San Francisco      NaN        False

In [4]:
df["Name"].value_counts()

Name
John      1
Jane      1
Mike      1
Emily     1
David     1
Sarah     1
Chris     1
Olivia    1
Name: count, dtype: int64

In [5]:
df["City"].value_counts()

City
New York         1
Los Angeles      1
Chicago          1
Houston          1
Phoenix          1
Dallas           1
Seattle          1
Denver           1
San Francisco    1
Name: count, dtype: int64

In [6]:
df["Is_Employed"].value_counts()

Is_Employed
True     5
False    5
Name: count, dtype: int64

In [8]:
df["City"].value_counts(dropna=False)

City
New York         1
Los Angeles      1
Chicago          1
NaN              1
Houston          1
Phoenix          1
Dallas           1
Seattle          1
Denver           1
San Francisco    1
Name: count, dtype: int64

In [10]:
null_counts = df.isnull()['Name']
null_counts

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8     True
9    False
Name: Name, dtype: bool

In [12]:
# Defining the dataframe
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alex'],
    'Age': [12, 34, 45]
})
df

    Name  Age
0  Alice   12
1    Bob   34
2   Alex   45

In [14]:
# Adding Columns to DFs, using a constant Variable
df['Country'] = 'Algeria'
df

    Name  Age  Country
0  Alice   12  Algeria
1    Bob   34  Algeria
2   Alex   45  Algeria

In [17]:
# Adding Columns using List
df['Gender'] = ['Female','Male','Male']
df

    Name  Age  Country  Gender
0  Alice   12  Algeria  Female
1    Bob   34  Algeria    Male
2   Alex   45  Algeria    Male

In [20]:
# Adding Columns using an existing Column (Transformation)
df['Age_after_2_years'] = df['Age'] + 2

In [25]:
# df.drop('Age_after_10_years', axis=1, inplace=True)

In [27]:
df

    Name  Age  Country  Gender  Age_after_2_years
0  Alice   12  Algeria  Female                 14
1    Bob   34  Algeria    Male                 36
2   Alex   45  Algeria    Male                 47

In [30]:
# Add column using a condition Expression (np.where)
df['Is_adult'] = np.where(df['Age'] < 50, 'YES', 'NO')
df

    Name  Age  Country  Gender  Age_after_2_years Is_adult
0  Alice   12  Algeria  Female                 14      YES
1    Bob   34  Algeria    Male                 36      YES
2   Alex   45  Algeria    Male                 47      YES

In [32]:
# Add column using a lambda function with apply()

df['Age_group'] = df.apply(lambda row: 'Young' if row['Age'] < 35 else 'Adult', axis=1)
df

    Name  Age  Country  Gender  Age_after_2_years Is_adult Age_group
0  Alice   12  Algeria  Female                 14      YES     Young
1    Bob   34  Algeria    Male                 36      YES     Young
2   Alex   45  Algeria    Male                 47      YES     Adult